# Import libraries

In [289]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [290]:
#1. Read data
data = pd.read_csv('train.csv')
data.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [291]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        100000 non-null  object
 1   Customer_ID               100000 non-null  object
 2   Month                     100000 non-null  object
 3   Name                      90015 non-null   object
 4   Age                       100000 non-null  object
 5   SSN                       100000 non-null  object
 6   Occupation                100000 non-null  object
 7   Annual_Income             100000 non-null  object
 8   Monthly_Inhand_Salary     84998 non-null   float64
 9   Num_Bank_Accounts         100000 non-null  int64
 10  Num_Credit_Card           100000 non-null  int64
 11  Interest_Rate             100000 non-null  int64
 12  Num_of_Loan               100000 non-null  object
 13  Type_of_Loan              88592 non-null   object
 14  Delay_from_due_date       100000 non-null  int64
 15  Num_of_Delayed_Payment    92998 non-null   object
 16  Changed_Credit_Limit      100000 non-null  object
 17  Num_Credit_Inquiries      98035 non-null   float64
 18  Credit_Mix                100000 non-null  object
 19  Outstanding_Debt          100000 non-null  object
 20  Credit_Utilization_Ratio  100000 non-null  float64
 21  Credit_History_Age        90970 non-null   object
 22  Payment_of_Min_Amount     100000 non-null  object
 23  Total_EMI_per_month       100000 non-null  float64
 24  Amount_invested_monthly   95521 non-null   object
 25  Payment_Behaviour         100000 non-null  object
 26  Monthly_Balance           98800 non-null   object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 21.4+ MB

In [292]:
data.describe()

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,84998.000000,100000.000000,100000.00000,100000.000000,100000.000000,98035.000000,100000.000000,100000.000000
mean,4194.170850,17.091280,22.47443,72.466040,21.068780,27.754251,32.285173,1403.118217
std,3183.686167,117.404834,129.05741,466.422621,14.860104,193.177339,5.116875,8306.041270
min,303.645417,-1.000000,0.00000,1.000000,-5.000000,0.000000,20.000000,0.000000
25%,1625.568229,3.000000,4.00000,8.000000,10.000000,3.000000,28.052567,30.306660
50%,3093.745000,6.000000,5.00000,13.000000,18.000000,6.000000,32.305784,69.249473
75%,5957.448333,7.000000,7.00000,20.000000,28.000000,9.000000,36.496663,161.224249
max,15204.633333,1798.000000,1499.00000,5797.000000,67.000000,2597.000000,50.000000,82331.000000

In [293]:
df1 = data.copy()

# Xử lý dữ liệu không nhất quán

# Age

In [294]:
df1["Age"].unique()

array(['23', '-500', '28_', ..., '4808_', '2263', '1342'], dtype=object)

In [295]:
# xoá các ký tự không hợp lệ:
df1['Age'] = df1['Age'].str.replace(' ', '').str.replace('-', '').str.replace('_', '')

# đổi về kiểu int:
df1["Age"] = pd.to_numeric(df1["Age"], downcast="integer")

# Check kiểu dữ liệu:
df1["Age"].dtype

dtype('int16')

In [296]:
# df1["Age"].unique()

In [297]:
# df1['Age'].hist(bins=10)

# SSN

In [298]:
df1["SSN"].unique()

array(['821-00-0265', '#F%$D@*&8', '004-07-5839', ..., '133-16-7738',
       '031-35-0942', '078-73-5990'], dtype=object)

In [299]:
df1.SSN.value_counts()

SSN
#F%$D@*&8      5572
940-15-4402       8
571-35-3463       8
422-50-2476       8
430-60-9262       8
               ...
604-62-6133       4
331-28-1921       4
838-33-4811       4
856-06-6147       4
753-72-2651       4
Name: count, Length: 12501, dtype: int64

In [300]:
# Thay đổi giá trị không hợp lệ bằng NaN
df1['SSN'] = df1['SSN'].replace('#F%$D@*&8', np.nan)

In [301]:
df1['SSN'].isna().sum()

np.int64(5572)

# Occupation

In [302]:
df1.Occupation.value_counts()

Occupation
_______          7062
Lawyer           6575
Architect        6355
Engineer         6350
Scientist        6299
Mechanic         6291
Accountant       6271
Developer        6235
Media_Manager    6232
Teacher          6215
Entrepreneur     6174
Doctor           6087
Journalist       6085
Manager          5973
Musician         5911
Writer           5885
Name: count, dtype: int64

In [303]:
# Thay đổi giá trị không hợp lệ bằng NaN
df1['Occupation'] = df1['Occupation'].replace('_______', np.nan)

In [304]:
df1['Occupation'].isna().sum()

np.int64(7062)

# Annual_Income

In [305]:
df1["Annual_Income"].unique()

array(['19114.12', '34847.84', '34847.84_', ..., '20002.88', '39628.99',
       '39628.99_'], dtype=object)

In [306]:
df1.Annual_Income.value_counts()

Annual_Income
36585.12     16
20867.67     16
17273.83     16
95596.35     15
33029.66     15
             ..
3917169.0     1
89394.78_     1
36806.84_     1
24363.78_     1
95685.21_     1
Name: count, Length: 18940, dtype: int64

In [307]:
# xoá ký tự "_" không hợp lệ:
df1["Annual_Income"] = df1["Annual_Income"].str.strip("_")

# chuyển str về int:
df1["Annual_Income"] = pd.to_numeric(df1["Annual_Income"], downcast="integer")
df1["Annual_Income"].dtype

dtype('float64')

# Payment_Behaviour

In [308]:
df1.Payment_Behaviour.value_counts()

Payment_Behaviour
Low_spent_Small_value_payments      25513
High_spent_Medium_value_payments    17540
Low_spent_Medium_value_payments     13861
High_spent_Large_value_payments     13721
High_spent_Small_value_payments     11340
Low_spent_Large_value_payments      10425
!@9#%8                               7600
Name: count, dtype: int64

In [309]:
# điền giá trị ko hợp lệ bằng nan
df1.loc[(df1["Payment_Behaviour"] == "!@9#%8"), "Payment_Behaviour"] = np.nan

# Monthly_Balance

In [310]:
df1["Monthly_Balance"].unique()

array(['312.49408867943663', '284.62916249607184', '331.2098628537912',
       ..., 516.8090832742814, 319.1649785257098, 393.6736955618808],
      dtype=object)

In [311]:
# đếm số lần xuất hiện của các giá trị duy nhất của cột Monthly_Balance:
df1.Monthly_Balance.value_counts(dropna=False)

Monthly_Balance
NaN                                 1200
__-333333333333333333333333333__       9
254.9709216273975                      1
250.0931678204641                      1
289.7550752754317                      1
                                    ...
278.8720257394474                      1
376.7024623690405                      1
321.2336043357731                      1
373.29270287694055                     1
336.6371802877606                      1
Name: count, Length: 98793, dtype: int64

In [312]:
# đếm giá trị ko hợp lệ:
df1[pd.to_numeric(
    df1["Monthly_Balance"],
    errors="coerce").isna()]["Monthly_Balance"].value_counts(dropna=False)

Monthly_Balance
NaN                                 1200
__-333333333333333333333333333__       9
Name: count, dtype: int64

In [313]:
# thay giá trị không hợp lệ bằng null:
df1["Monthly_Balance"] = df1["Monthly_Balance"].replace('__-333333333333333333333333333__', np.nan)

In [314]:
# # loại bỏ ký tự không hợp lệ:
# df1['Monthly_Balance'] = df1['Monthly_Balance'].apply(
#     lambda x: x.replace('_', '').replace('-', '') if isinstance(x, str) else x)

# chuyển về kiểu float:
df1["Monthly_Balance"] = df1["Monthly_Balance"].astype('float')

# Check kiểu dữ liệu:
df1["Monthly_Balance"].dtype

dtype('float64')

In [315]:
# df1["Monthly_Balance"].hist(bins=10)

In [316]:
# df1["Monthly_Balance"].isna().sum()

# Credit_Mix

In [317]:
df1["Credit_Mix"].unique()

array(['_', 'Good', 'Standard', 'Bad'], dtype=object)

In [318]:
df1.Credit_Mix.value_counts()

Credit_Mix
Standard    36479
Good        24337
_           20195
Bad         18989
Name: count, dtype: int64

In [319]:
# chuyển "_" bằng null
df1.loc[df1["Credit_Mix"] == "_", "Credit_Mix"] = pd.NA

In [320]:
df1["Credit_Mix"].isna().sum()

np.int64(20195)

# Outstanding_Debt

In [321]:
df1.Outstanding_Debt.value_counts().sample(10)

Outstanding_Debt
1669.88    8
531.86     8
2156.34    8
1010.56    8
800.89     8
3566.21    8
1428.58    8
3651.35    7
4265.64    8
1084.02    8
Name: count, dtype: int64

In [322]:
df1[pd.to_numeric(df1["Outstanding_Debt"], errors="coerce").isna()]["Outstanding_Debt"].head(20)

87      1328.93_
142     1283.37_
368     2797.17_
632     3818.57_
703      343.84_
731      363.51_
782      404.51_
819     1755.81_
835     2593.44_
992       89.62_
1147    1054.86_
1148    1054.86_
1162    1374.23_
1243    1166.47_
1339     457.81_
1369    1684.06_
1486    1126.35_
1542    2098.83_
1573     761.18_
1633    1343.01_
Name: Outstanding_Debt, dtype: object

In [323]:
df1["Outstanding_Debt"] = df1["Outstanding_Debt"].str.strip("_")

df1["Outstanding_Debt"] = pd.to_numeric(df1["Outstanding_Debt"], downcast="float")

df1["Outstanding_Debt"].dtype

dtype('float32')

# Num_of_Loan

In [324]:
df1["Num_of_Loan"].unique()

array(['4', '1', '3', '967', '-100', '0', '0_', '2', '3_', '2_', '7', '5',
       '5_', '6', '8', '8_', '9', '9_', '4_', '7_', '1_', '1464', '6_',
       '622', '352', '472', '1017', '945', '146', '563', '341', '444',
       '720', '1485', '49', '737', '1106', '466', '728', '313', '843',
       '597_', '617', '119', '663', '640', '92_', '1019', '501', '1302',
       '39', '716', '848', '931', '1214', '186', '424', '1001', '1110',
       '1152', '457', '1433', '1187', '52', '1480', '1047', '1035',
       '1347_', '33', '193', '699', '329', '1451', '484', '132', '649',
       '995', '545', '684', '1135', '1094', '1204', '654', '58', '348',
       '614', '1363', '323', '1406', '1348', '430', '153', '1461', '905',
       '1312', '1424', '1154', '95', '1353', '1228', '819', '1006', '795',
       '359', '1209', '590', '696', '1185_', '1465', '911', '1181', '70',
       '816', '1369', '143', '1416', '455', '55', '1096', '1474', '420',
       '1131', '904', '89', '1259', '527', '1241', '449', '983', '418',
       '319', '23', '238', '638', '138', '235_', '280', '1070', '1484',
       '274', '494', '1459_', '404', '1354', '1495', '1391', '601',
       '1313', '1319', '898', '231', '752', '174', '961', '1046', '834',
       '284', '438', '288', '1463', '1151', '719', '198', '1015', '855',
       '841', '392', '1444', '103', '1320_', '745', '172', '252', '630_',
       '241', '31', '405', '1217', '1030', '1257', '137', '157', '164',
       '1088', '1236', '777', '1048', '613', '330', '1439', '321', '661',
       '952', '939', '562', '1202', '302', '943', '394', '955', '1318',
       '936', '781', '100', '1329', '1365', '860', '217', '191', '32',
       '282', '351', '1387', '757', '416', '833', '359_', '292', '1225_',
       '1227', '639', '859', '243', '267', '510', '332', '996', '597',
       '311', '492', '820', '336', '123', '540', '131_', '1311_', '1441',
       '895', '891', '50', '940', '935', '596', '29', '1182', '1129_',
       '1014', '251', '365', '291', '1447', '742', '1085', '148', '462',
       '832', '881', '1225', '1412', '785_', '1127', '910', '538', '999',
       '733', '101', '237', '87', '659', '633', '387', '447', '629',
       '831', '1384', '773', '621', '1419', '289', '143_', '285', '1393',
       '1131_', '27_', '1359', '1482', '1189', '1294', '201', '579',
       '814', '141', '1320', '581', '1171_', '295', '290', '433', '679',
       '1040', '1054', '1430', '1023', '1077', '1457', '1150', '701',
       '1382', '889', '437', '372', '1222', '126', '1159', '868', '19',
       '1297', '227_', '190', '809', '1216', '1074', '571', '520', '1274',
       '1340', '991', '316', '697', '926', '873', '1002', '378_', '65',
       '875', '867', '548', '652', '1372', '606', '1036', '1300', '17',
       '1178', '802', '1219_', '1271', '1137', '1496', '439', '196',
       '636', '192', '228', '1053', '229', '753', '1296', '1371', '254',
       '863', '464', '515', '838', '1160', '1289', '1298', '799', '182',
       '574', '527_', '242', '415', '869', '958', '54', '1265', '656',
       '275', '778', '208', '147', '350', '507', '463', '497', '1129',
       '927', '653', '662', '529', '635', '1027_', '897', '1039', '227',
       '1345', '924', '696_', '1279', '546', '1112', '1210', '526', '300',
       '1103', '504', '136', '1400', '78', '686', '1091', '344', '215',
       '84', '628', '1470', '968', '1478', '83', '1196', '1307', '1132_',
       '1008', '917', '657', '56', '18', '41', '801', '978', '216', '349',
       '966'], dtype=object)

In [325]:
df1[pd.to_numeric(df1["Num_of_Loan"], errors="coerce").isna()]["Num_of_Loan"].head(20)

37     0_
80     3_
84     3_
94     2_
119    5_
125    2_
131    0_
144    0_
158    5_
256    2_
360    8_
366    8_
377    2_
382    2_
391    9_
410    5_
442    4_
481    7_
483    7_
486    7_
Name: Num_of_Loan, dtype: object

In [326]:
df1["Num_of_Loan"] = df1["Num_of_Loan"].str.strip("_")
df1["Num_of_Loan"] = pd.to_numeric(df1["Num_of_Loan"], downcast="integer")

df1["Num_of_Loan"].dtype

dtype('int16')

# Num_of_Delayed_Payment

In [327]:
df1["Num_of_Delayed_Payment"].unique()

array(['7', nan, '4', '8_', '6', '1', '-1', '3_', '0', '8', '5', '3', '9',
       '12', '15', '17', '10', '2', '2_', '11', '14', '20', '22', '13',
       '13_', '14_', '16', '12_', '18', '19', '23', '24', '21', '3318',
       '3083', '22_', '1338', '4_', '26', '11_', '3104', '21_', '25',
       '10_', '183_', '9_', '1106', '834', '19_', '24_', '17_', '23_',
       '2672', '20_', '2008', '-3', '538', '6_', '1_', '16_', '27', '-2',
       '3478', '2420', '15_', '707', '708', '26_', '18_', '3815', '28',
       '5_', '1867', '2250', '1463', '25_', '7_', '4126', '2882', '1941',
       '2655', '2628', '132', '3069', '306', '0_', '3539', '3684', '1823',
       '4128', '1946', '827', '2297', '2566', '904', '182', '929', '3568',
       '2503', '1552', '2812', '1697', '3764', '851', '3905', '923', '88',
       '1668', '3253', '808', '2689', '3858', '642', '3457', '1402',
       '1732', '3154', '847', '3037', '2204', '3103', '1063', '2056',
       '1282', '1841', '2569_', '211', '793', '3484', '411', '3491',
       '2072', '3050', '1049', '2162', '3402', '2753', '27_', '1718',
       '1014', '3260', '3855', '84', '2311', '3251', '1832', '4069',
       '3010', '733', '4241', '166', '2461', '1749', '3200', '663_',
       '2185', '4161', '3009', '359', '2015', '1523', '594', '1079',
       '1199', '186', '1015', '1989', '281', '559', '2165', '1509',
       '3545', '779', '192', '4311', '-2_', '2323', '1471', '1538',
       '3529', '439', '3456', '3040', '2697', '3179', '1332', '3175',
       '3112', '829', '4022', '3870', '4023', '531', '1511', '3092',
       '3191', '2400', '3621', '3536', '544', '1864', '28_', '142',
       '2300', '264', '72', '497', '398', '2222', '3960', '1473', '3043',
       '4216', '2903', '2658', '-1_', '4042', '1323_', '2184', '921',
       '1328', '3404', '2438', '809', '47', '1996', '4164', '1370',
       '1204', '2167', '4011', '2590', '2594', '2533', '1663', '1018',
       '2919', '3458', '3316', '2589', '2801', '3355', '2529', '2488',
       '4266', '1243', '739', '845', '4107', '1884', '337', '2660', '290',
       '674', '2450', '3738', '1792', '2823', '2570', '775', '960', '482',
       '1706', '2493', '3623', '3031', '2794_', '2219_', '758_', '1849',
       '3559', '4096', '3726', '1953', '2657', '4043', '2938', '4384',
       '1647', '2694', '3533', '519', '2677', '2413', '-3_', '4139',
       '2609', '4326', '4211', '823', '3011', '1608', '2860', '4219',
       '4047', '1531', '742', '52', '4024', '1673', '49', '2243', '1685',
       '1869', '2587', '3489', '749', '1164', '2616', '848_', '4134',
       '1530', '1502', '4075', '3845', '1060', '2573', '2128', '328',
       '640', '2585', '2230', '1795', '1180', '1534', '3739', '3313',
       '4191', '996', '372', '3340', '3177', '602', '787', '4135', '3878',
       '4059', '1218', '4051', '1766', '1359', '3107', '585', '1263',
       '2511', '709', '3632', '4077', '2943', '2793', '3245', '2317',
       '1640', '2237_', '3819', '252', '3978', '1498', '1833', '2737',
       '1192', '1481', '700', '271', '2286', '273', '1215', '3944',
       '2070', '1478', '3749', '871', '2508', '2959', '130', '294',
       '3097_', '3511', '415', '2196', '2138', '2149', '1874', '1553',
       '3847', '3222', '1222', '2907', '3051', '98', '1598', '416',
       '2314', '2955', '1691', '1450', '2021', '1636', '80', '3708',
       '195', '320', '2945', '1911', '3416', '3796', '4159', '2255',
       '938', '4397', '3776', '2148', '1994', '853', '1178', '1633',
       '196', '3864', '714', '1687', '1034', '468', '1337', '2044',
       '1541', '3661', '1211', '2645', '2007', '102', '1891', '3162',
       '3142', '2566_', '2766', '3881', '2728', '2671', '1952', '3580',
       '2705', '4251', '3840_', '972', '3119', '3502', '4185', '2954',
       '683', '1614', '1572', '4302', '3447', '1852', '2131', '1900',
       '1699', '133', '2018', '2127', '508', '210', '577', '1664', '2604',
       '1411', '2351', '867', '1371', '2352', '1191', '905', '4053',
       '3869', '933', '3660', '3300', '3629', '3208', '2142', '2521',
       '450', '583', '876', '121', '3919', '2560', '2578', '2060', '813',
       '1236', '1489', '4360', '1154', '2544', '4172', '2924', '426',
       '4270', '2768', '3909', '3951', '2712', '2498', '3171', '1750',
       '197', '2569', '265', '4293', '887', '2707', '2397', '4337',
       '4249', '2751', '2950', '1859', '107', '2348', '2506', '2810',
       '2873', '1301', '2262', '1890', '3078', '3865', '3268', '2777',
       '3105', '1278', '3793', '2276', '2879', '4298', '2141', '223',
       '2239', '846', '1862', '2756', '1181', '1184', '2617', '3972',
       '2334', '3900', '2759', '4169', '2280', '2492', '2729', '3750',
       '1825', '309', '2431', '3099', '2080', '2279', '2666', '3722',
       '1976', '529', '1985', '3060', '4278', '3212', '46', '3148',
       '3467', '4231', '3790', '473', '1536', '3955', '2324', '2381',
       '1177', '371', '2896', '3880', '2991', '4319', '1061', '662',
       '4144', '693', '2006', '3115', '2278_', '3751', '1861', '4262',
       '2913', '2615', '3492', '800', '3766', '384', '3407', '1087',
       '3329', '1086', '2216', '1087_', '2457', '3522', '3274', '3488',
       '2854', '238', '351', '3706', '4280', '4095', '2926', '1329',
       '3370', '283', '1392', '1743', '2429', '974', '3156', '1133',
       '4388', '3243', '4282', '2523', '4281', '3415', '2001', '441',
       '94', '3499', '969', '3368', '106', '1004', '2638', '3946', '2956',
       '4324', '85', '4113', '819', '615', '1172', '2553', '1765', '3495',
       '2820', '4239', '4340', '1295_', '2636', '4295', '1653', '1325',
       '1879', '1096', '1735', '3584', '1073', '1975', '3827', '2552',
       '3754', '2378', '532', '926', '2376', '3636', '3763', '778',
       '2621', '804', '754', '2418', '4019', '3926', '3861_', '3574',
       '175', '162', '2834', '3765', '2354', '523', '2274', '1606',
       '1443', '1354', '2142_', '1422', '2278', '1045', '4106', '3155',
       '666', '659', '3229', '1216', '2076', '1473_', '2384', '1954',
       '719', '2534', '4002', '541', '2875', '4344', '2081', '3894',
       '1256', '676', '4178', '399', '86', '1571', '4037', '1967', '4005',
       '3216', '1150', '2591', '1801', '3721', '1775', '2260', '3707',
       '4292', '1820', '145', '1480', '1850', '430', '217', '3920_',
       '1389', '1579', '3391', '2385', '3336', '3392', '3688', '221',
       '2047'], dtype=object)

In [328]:
df1["Num_of_Delayed_Payment"] = df1["Num_of_Delayed_Payment"].str.strip("_")

df1["Num_of_Delayed_Payment"] = pd.to_numeric(df1["Num_of_Delayed_Payment"],
                                              downcast="integer")

df1["Num_of_Delayed_Payment"].dtype

dtype('float64')

# Amount_invested_monthly

In [329]:
df1.Amount_invested_monthly.value_counts()

Amount_invested_monthly
__10000__             4305
0.0                    169
59.93725850034815        1
165.180659491917         1
62.030802602004044       1
                      ...
109.296681189146         1
33.6098814431885         1
76.87001005130772        1
908.6939096189257        1
401.35900899207513       1
Name: count, Length: 91049, dtype: int64

In [330]:
df1[pd.to_numeric(df1["Amount_invested_monthly"], errors="coerce").isna()]["Amount_invested_monthly"].value_counts(dropna=False)

Amount_invested_monthly
NaN          4479
__10000__    4305
Name: count, dtype: int64

In [331]:
df1["Amount_invested_monthly"] = df1["Amount_invested_monthly"].str.strip("_")

df1["Amount_invested_monthly"] = pd.to_numeric(df1["Amount_invested_monthly"],
                                               downcast="float")

df1["Amount_invested_monthly"].dtype

dtype('float32')

# Credit_History_Age

In [332]:
# Tách số năm và số tháng
years = df1['Credit_History_Age'].str.extract(r'(\d+)\s+Years')[0]
months = df1['Credit_History_Age'].str.extract(r'(\d+)\s+Months')[0]

# Chuyển sang float, xử lý NaN
years = pd.to_numeric(years, errors='coerce')
months = pd.to_numeric(months, errors='coerce')

# Tính tổng số tháng và giữ nguyên giá trị NaN
df1['Credit_History_Age_Months'] = (years * 12 + months).round()

# Không ép kiểu sang Int64 để tránh lỗi với NaN
df1['Credit_History_Age_Months'] = df1['Credit_History_Age_Months'].astype('Int64')

# Xem kết quả
df1[['Credit_History_Age', 'Credit_History_Age_Months']].head()

      Credit_History_Age  Credit_History_Age_Months
0  22 Years and 1 Months                        265
1                    NaN                       <NA>
2  22 Years and 3 Months                        267
3  22 Years and 4 Months                        268
4  22 Years and 5 Months                        269

In [333]:
df1['Credit_History_Age_Months']

0         265
1        <NA>
2         267
3         268
4         269
         ...
99995     378
99996     379
99997     380
99998     381
99999     382
Name: Credit_History_Age_Months, Length: 100000, dtype: Int64

In [334]:
# df1.head()

# Kiểm tra dữ liệu thiếu

In [335]:
df2 = df1

In [336]:
# in ra các cột có số lượng null >0
df2.isnull().sum()[df2.isnull().sum() > 0]

Name                          9985
SSN                           5572
Occupation                    7062
Monthly_Inhand_Salary        15002
Type_of_Loan                 11408
Num_of_Delayed_Payment        7002
Num_Credit_Inquiries          1965
Credit_Mix                   20195
Credit_History_Age            9030
Amount_invested_monthly       4479
Payment_Behaviour             7600
Monthly_Balance               1209
Credit_History_Age_Months     9030
dtype: int64

In [337]:
# df2.info()

In [338]:
def show_missing_data(df):
  missing_data = data.isnull().sum()
  missing_data = missing_data[missing_data > 0]
  missing_percentage = (missing_data / len(data)) * 100
  missing_table = pd.DataFrame({'Missing Values': missing_data,
                                 'Percentage (%)': missing_percentage})
  print("Cột có giá trị null và tỷ lệ phần trăm missing:")
  print(missing_table.sort_values(by='Percentage (%)', ascending=False))


show_missing_data(df2)

Cột có giá trị null và tỷ lệ phần trăm missing:
                         Missing Values  Percentage (%)
Monthly_Inhand_Salary             15002          15.002
Type_of_Loan                      11408          11.408
Name                               9985           9.985
Credit_History_Age                 9030           9.030
Num_of_Delayed_Payment             7002           7.002
Amount_invested_monthly            4479           4.479
Num_Credit_Inquiries               1965           1.965
Monthly_Balance                    1200           1.200

- Name: có những khách hàng chưa được thêm thông tin tuy nhiên tại cột Custormer_ID đủ thông tin nên ta điền thông tin Name dựa vào cột Custormer_ID tương ứng
- Monthly_Inhand_Salary: có thể thêm mức lương dựa vào cột lương trung bình hàng năm(Annual_Income)
- SSN(mã số an sinh xã hội): vì mỗi khách hàng có mỗi mã SSN khác nhau nên ta dựa vào cột Custormer_ID để điền thông tin
-

# Xử lý dữ liệu thiếu

1. Name

In [339]:
#2. Convert into lower and check shape
df2.columns = [x.lower() for x in df2.columns]
# print(df2.columns)
# print(f'Số hàng và số cột của data: {data.shape}')

In [340]:
# Is the number of occurrences for each customer_id the same?
(df2["customer_id"].value_counts() == 8).all()

np.True_

In [341]:
# Fill missing values in the "name" column with the mode of each customer group.
df2["name"] = df2.groupby("customer_id")["name"].transform(
    lambda x: x.fillna(x.mode()[0]))

# Check if each customer group in "name" has exactly 8 observations.
(df2.groupby("customer_id")["name"].count() == 8).all()

np.True_

In [342]:
# df1.groupby("customer_id")["name"].count()

2. SSN

In [343]:
# Group by "customer_id" and fill missing SSNs with the most frequent value within each group
df2['ssn'] = df2.groupby('customer_id')['ssn'].transform(lambda x: x.fillna(x.mode()[0]) if not x.mode().empty else x)

In [344]:
df2.ssn.value_counts()

ssn
078-73-5990    8
821-00-0265    8
004-07-5839    8
486-85-3974    8
061-64-3430    8
              ..
070-19-1622    8
500-92-6408    8
411-51-0676    8
612-70-8987    8
615-06-7821    8
Name: count, Length: 12500, dtype: int64

3. Occupation

In [345]:
df2["occupation"] = df2.groupby("customer_id")["occupation"].transform(
    lambda x: x.fillna(x.mode()[0]) if not x.mode().empty else x)

In [346]:
# Count the number of customers with only one unique occupation
(df2.groupby("customer_id")["occupation"].nunique() == 1).sum()  # 12500X8 = 100000

np.int64(12500)

4. Monthly_Inhand_Salary

In [347]:
# df2.month

lambda x: x.fillna(method="ffill").fillna(method="bfill"):

fillna(method="ffill"): Forward fill — điền giá trị thiếu bằng giá trị phía trước trong cùng nhóm customer_id.

Sau đó tiếp tục .fillna(method="bfill"): nếu vẫn còn NaN ở đầu chuỗi (không có giá trị phía trước), thì dùng backward fill — lấy giá trị phía sau để điền.

In [348]:
# Sắp xếp dữ liệu theo customer_id và month
# df2 = df2.sort_values(by=["customer_id", "month"])

# Điền giá trị thiếu trong cột monthly_inhand_salary theo nhóm customer_id
df2["monthly_inhand_salary"] = df2.groupby("customer_id")["monthly_inhand_salary"]\
    .transform(lambda x: x.fillna(method="ffill").fillna(method="bfill"))

In [349]:
# Check the maximum difference between unique monthly_inhand_salary values for each customer
filtered_df = df2.groupby("customer_id")["monthly_inhand_salary"].unique()
filtered_df

customer_id
CUS_0x1000    [2706.1616666666664]
CUS_0x1009               [4250.39]
CUS_0x100b             [9549.7825]
CUS_0x1011             [5208.8725]
CUS_0x1013     [7962.415000000001]
                      ...
CUS_0xff3             [1176.39875]
CUS_0xff4               [2415.855]
CUS_0xff6      [9727.326666666666]
CUS_0xffc              [5218.0975]
CUS_0xffd                [3749.87]
Name: monthly_inhand_salary, Length: 12500, dtype: object

In [350]:
# thêm một cột là số lượng số lương vào filtered_df
filtered_df = filtered_df.apply(lambda x: len(x))
filtered_df.unique()

array([1, 2])

5. Type_of_Loan

In [351]:
# Groups the data by 'customer_id', counts the occurrences of each 'type_of_loan' for each customer,
# and then randomly samples 20 rows from the result
df2.groupby("customer_id")["type_of_loan"].value_counts().sample(10)

customer_id  type_of_loan
CUS_0x76fc   Payday Loan, Mortgage Loan, Personal Loan, and Debt Consolidation Loan                                                                  8
CUS_0x20f3   Not Specified, and Mortgage Loan                                                                                                        8
CUS_0x51ff   Payday Loan                                                                                                                             8
CUS_0x1e84   Payday Loan, and Auto Loan                                                                                                              8
CUS_0x407c   Student Loan, Student Loan, Personal Loan, and Auto Loan                                                                                8
CUS_0x4c59   Debt Consolidation Loan, Credit-Builder Loan, Home Equity Loan, Personal Loan, Payday Loan, Payday Loan, and Debt Consolidation Loan    8
CUS_0x88c    Credit-Builder Loan, Payday Loan, Auto Loan, Student Loan, Home Equity Loan, and Mortgage Loan                                          8
CUS_0x3cc8   Student Loan, and Student Loan                                                                                                          8
CUS_0x456f   Mortgage Loan, Student Loan, and Not Specified                                                                                          8
CUS_0x7d48   Student Loan, Debt Consolidation Loan, Not Specified, Debt Consolidation Loan, Personal Loan, Home Equity Loan, and Payday Loan         8
Name: count, dtype: int64

In [352]:
# Groups the data by 'customer_id' and 'type_of_loan', counts the occurrences of each loan type per customer,
# then counts how many times each unique count of loan types appears across customers.
df2.groupby("customer_id")["type_of_loan"].value_counts().value_counts()

count
8    11074
Name: count, dtype: int64

In [353]:
# Counts the number of customers where the 'type_of_loan' is missing (NaN).
df2[df2["type_of_loan"].isna()]["customer_id"].count()

np.int64(11408)

In [354]:
# Updates the 'type_of_loan' column to "No Loan" for customers who have 0 loans.
df2.loc[df2["num_of_loan"] == 0, "type_of_loan"] = "No Loan"

In [355]:
df2.groupby("customer_id")["type_of_loan"].value_counts().value_counts()

count
8    12082
7      361
6       54
5        3
Name: count, dtype: int64

In [356]:
df2[df2["type_of_loan"].isna()]["customer_id"].count()

np.int64(478)

In [357]:
df2["type_of_loan"].isna().sum()

np.int64(478)

In [358]:
# # Removes the string " and" from the 'type_of_loan' column without using regular expressions.
# df2["type_of_loan"] = df2["type_of_loan"].str.replace(" and", "", regex=False)

# # Splits the 'type_of_loan' column by ", " to create a list of loan types for each row.
# df2["type_of_loan"] = df2["type_of_loan"].str.split(", ")

In [359]:
# df2["type_of_loan"].value_counts().sample(10)

6. Num_of_Delayed_Payment

In [360]:
# Counting the number of missing ('NaN') values in 'num_of_delayed_payment' for each 'customer_id'
df2[df2["num_of_delayed_payment"].isna()].groupby("customer_id").size()

customer_id
CUS_0x1011    2
CUS_0x1013    1
CUS_0x1018    1
CUS_0x102d    1
CUS_0x102e    1
             ..
CUS_0xfdd     1
CUS_0xfe3     3
CUS_0xfe4     2
CUS_0xff6     1
CUS_0xffd     1
Length: 5465, dtype: int64

In [361]:
# Counting the frequency of each unique value in 'num_of_delayed_payment' and sorting by index
df2["num_of_delayed_payment"].value_counts().sort_index().head(50)

num_of_delayed_payment
-3.0        94
-2.0       234
-1.0       316
 0.0      1609
 1.0      1636
 2.0      1810
 3.0      1931
 4.0      1838
 5.0      2091
 6.0      2321
 7.0      2385
 8.0      4873
 9.0      4981
 10.0     5309
 11.0     4810
 12.0     5059
 13.0     4036
 14.0     4193
 15.0     5237
 16.0     5312
 17.0     5412
 18.0     5216
 19.0     5481
 20.0     5089
 21.0     2553
 22.0     2339
 23.0     2028
 24.0     1701
 25.0     1665
 26.0      322
 27.0      250
 28.0      131
 46.0        1
 47.0        1
 49.0        1
 52.0        1
 72.0        1
 80.0        1
 84.0        1
 85.0        1
 86.0        1
 88.0        1
 94.0        1
 98.0        1
 102.0       1
 106.0       1
 107.0       1
 121.0       1
 130.0       1
 132.0       1
Name: count, dtype: int64

In [362]:
# Handling out-of-range values for 'num_of_delayed_payment'
df2.loc[(df2["num_of_delayed_payment"] < 0) | (df2["num_of_delayed_payment"] > 28), "num_of_delayed_payment"] = np.nan

# Filling missing values (NaN) within each 'customer_id' group using forward and backward fill
df2["num_of_delayed_payment"] = df2.groupby("customer_id")["num_of_delayed_payment"].transform(
    lambda x: x.fillna(method="ffill").fillna(method="bfill"))

# Checking the total number of missing values after filling
df2["num_of_delayed_payment"].isna().sum()

np.int64(0)

7. Num_Credit_Inquiries

In [363]:
# Group by 'customer_id' and get unique values in the 'num_credit_inquiries' column for each customer
df2.groupby("customer_id")["num_credit_inquiries"].unique()

customer_id
CUS_0x1000          [10.0, 11.0]
CUS_0x1009            [2.0, 4.0]
CUS_0x100b    [1.0, 2271.0, 4.0]
CUS_0x1011         [7.0, 1965.0]
CUS_0x1013                 [3.0]
                     ...
CUS_0xff3             [3.0, 5.0]
CUS_0xff4             [5.0, nan]
CUS_0xff6             [nan, 2.0]
CUS_0xffc            [8.0, 13.0]
CUS_0xffd     [1801.0, nan, 7.0]
Name: num_credit_inquiries, Length: 12500, dtype: object

In [364]:
# Get the value counts of 'num_credit_inquiries', including NaN values, and display the top 30
df2["num_credit_inquiries"].value_counts(dropna=False).head(30)

num_credit_inquiries
4.0       11271
3.0        8890
6.0        8111
7.0        8058
2.0        8028
8.0        7866
1.0        7588
0.0        6972
5.0        5693
9.0        5283
11.0       5051
10.0       4936
12.0       4571
NaN        1965
13.0       1480
14.0       1039
15.0        808
16.0        456
17.0        284
1460.0        4
53.0          4
318.0         4
1786.0        4
31.0          4
1244.0        4
2297.0        4
2310.0        4
285.0         4
1114.0        4
1768.0        4
Name: count, dtype: int64

In [365]:
# The data is inconsistent;
#But while the 'Num of Loans' value is recorded over a 6-year period,
#the 'num_credit_inquiries' value is only recorded for 2 years
df2[df2["num_credit_inquiries"] == 0][["num_credit_inquiries", "num_of_loan"]]

       num_credit_inquiries  num_of_loan
120                     0.0            2
121                     0.0            2
128                     0.0            0
176                     0.0            0
177                     0.0            0
...                     ...          ...
99795                   0.0            1
99796                   0.0            1
99797                   0.0            1
99798                   0.0            1
99799                   0.0            1

[6972 rows x 2 columns]

In [366]:
# Fill NaN values using forward fill and backward fill within each customer_id group
df2["num_credit_inquiries"] = df2.groupby("customer_id")["num_credit_inquiries"].transform(
    lambda x: x.fillna(method="ffill").fillna(method="bfill"))

# Check how many NaN values are left in 'num_credit_inquiries'
df2["num_credit_inquiries"].isna().sum()

np.int64(0)

8. Credit_Mix

In [367]:
df2.credit_mix.value_counts()

credit_mix
Standard    36479
Good        24337
Bad         18989
Name: count, dtype: int64

In [389]:
# Group by customer_id and count unique values in credit_mix, then display the first 20
df2.groupby("customer_id")["credit_mix"].value_counts().head(20)

customer_id  credit_mix
CUS_0x1000   Bad           8
CUS_0x1009   Standard      8
CUS_0x100b   Good          8
CUS_0x1011   Standard      8
CUS_0x1013   Good          8
CUS_0x1015   Standard      8
CUS_0x1018   Bad           8
CUS_0x1026   Good          8
CUS_0x102d   Good          8
CUS_0x102e   Standard      8
CUS_0x1032   Standard      8
CUS_0x1037   Good          8
CUS_0x1038   Standard      8
CUS_0x103e   Good          8
CUS_0x1041   Bad           8
CUS_0x1044   Good          8
CUS_0x1048   Standard      8
CUS_0x104a   Good          8
CUS_0x104e   Standard      8
CUS_0x104f   Standard      8
Name: count, dtype: int64

In [369]:
# Count how many customer_ids have exactly 3 unique credit_mix values
(df2.groupby(["customer_id"])["credit_mix"].nunique() == 3).sum()

np.int64(0)

In [370]:
# Fill NaN values in 'credit_mix' for each customer with the most frequent value (mode)
df2["credit_mix"] = df2.groupby("customer_id")["credit_mix"].transform(
    lambda x: x.fillna(x.mode()[0]))

# Check the number of remaining NaN values in 'credit_mix'
df2["credit_mix"].isna().sum()

np.int64(0)

9. Credit_History_Age

10. Amount_invested_monthly

In [371]:
# Count occurrences of each unique value in the amount_invested_monthly' column, including NaN value
df2.amount_invested_monthly.value_counts(dropna=False).head(20)

amount_invested_monthly
NaN             4479
10000.000000    4305
0.000000         169
56.584618          2
105.325279         2
257.395691         2
174.601471         2
133.477356         2
154.766571         2
278.636566         2
536.648132         2
314.737213         2
163.614243         2
146.224899         2
576.811584         2
25.415653          2
43.304020          2
42.652752          2
289.631561         2
70.798302          2
Name: count, dtype: int64

In [372]:
# Check if all values in 'amount_invested_monthly' are NaN for each 'customer_id'
df2.groupby("customer_id")["amount_invested_monthly"].apply(
    lambda x: x.isna().all()).sum()

np.int64(0)

In [373]:
# Fill missing values in 'amount_invested_monthly' using forward fill and backward fill
df2["amount_invested_monthly"] = df2.groupby("customer_id")["amount_invested_monthly"].transform(
    lambda x: x.fillna(method="ffill").fillna(method="bfill"))

# Check how many missing values are left in 'amount_invested_monthly'
df2["amount_invested_monthly"].isna().sum()

np.int64(0)

11. Payment_Behaviour

In [374]:
# Count the occurrences of each unique value in the 'payment_behaviour' column, including NaN values
df2.payment_behaviour.value_counts(dropna=False)

payment_behaviour
Low_spent_Small_value_payments      25513
High_spent_Medium_value_payments    17540
Low_spent_Medium_value_payments     13861
High_spent_Large_value_payments     13721
High_spent_Small_value_payments     11340
Low_spent_Large_value_payments      10425
NaN                                  7600
Name: count, dtype: int64

In [375]:
# Group the DataFrame by 'customer_id', then calculate the number of unique values in the 'payment_behaviour' column for each customer
df2.groupby(["customer_id"])["payment_behaviour"].nunique().head(10)

customer_id
CUS_0x1000    4
CUS_0x1009    3
CUS_0x100b    5
CUS_0x1011    4
CUS_0x1013    3
CUS_0x1015    4
CUS_0x1018    3
CUS_0x1026    4
CUS_0x102d    4
CUS_0x102e    5
Name: payment_behaviour, dtype: int64

In [376]:
# Fill the missing 'payment_behaviour' values within each 'customer_id' group using forward-fill (ffill) and backward-fill (bfill)
df2["payment_behaviour"] = df2.groupby("customer_id")["payment_behaviour"].transform(
    lambda x: x.fillna(method="ffill").fillna(method="bfill"))

# Check how many missing values are left in the 'payment_behaviour' column
df2["payment_behaviour"].isna().sum()

np.int64(0)

12. Monthly_Balance

In [377]:
# Fill missing 'monthly_balance' values with the mean of each 'customer_id' group
df2["monthly_balance"] = df2.groupby("customer_id")["monthly_balance"].transform(lambda x: x.fillna(x.mean()))

In [378]:
# Count the number of customer_id groups where all monthly_balance values are NaN
df2.groupby("customer_id")["monthly_balance"].apply(
    lambda x: x.isna().all()).sum()

np.int64(0)

13. Credit_History_Age_Months

In [379]:
def fill_nan(group):
    # First loop: Fill NaN values with the previous value + 1
    for i in range(len(group)):
        if pd.isna(group.loc[group.index[i], "credit_history_age_months"]):
            # Get the previous value
            if i > 0:
                group.loc[group.index[i], "credit_history_age_months"] = (
                    group.loc[group.index[i - 1], "credit_history_age_months"] + 1
                )
            else:
                group.loc[group.index[i], "credit_history_age_months"] = np.nan

    # Second loop: Fill NaN values by looking forward (backward fill)
    for i in range(len(group) - 1, -1, -1):
        if pd.isna(group.loc[group.index[i], "credit_history_age_months"]):
            if i < len(group) - 1:
                group.loc[group.index[i], "credit_history_age_months"] = (
                    group.loc[group.index[i + 1], "credit_history_age_months"] - 1
                )

    return group

In [380]:
# Grouping the DataFrame by 'customer_id' and applying the 'fill_nan' function to each group
# The 'group_keys=False' ensures that the group labels are not included in the result.
df2 = df2.groupby("customer_id", group_keys=False).apply(fill_nan)

In [381]:
df2.credit_history_age_months.isna().sum()

np.int64(0)

In [388]:
df2.groupby("customer_id")["credit_history_age_months"].value_counts().head(20)
#

customer_id  credit_history_age_months
CUS_0x1000   122                          1
             123                          1
             124                          1
             125                          1
             126                          1
             127                          1
             128                          1
             129                          1
CUS_0x1009   365                          1
             366                          1
             367                          1
             368                          1
             369                          1
             370                          1
             371                          1
             372                          1
CUS_0x100b   183                          1
             184                          1
             185                          1
             186                          1
Name: count, dtype: Int64